#!/usr/bin/python
# -*- coding: UTF-8 -*-
import MySQLdb
import sys
import datetime
import time

table=['20','21','22','23','24','25','26']

station=["10号线三门路","10号线上海动物园","10号线上海图书馆","10号线五角场","10号线交通大学","10号线伊犁路","10号线同济大学","10号线四川北路","10号线国权路","10号线天潼路","10号线宋园路","10号线新天地","10号线新江湾城","10号线殷高东路","10号线水城路","10号线江湾体育场","10号线紫藤路","10号线航中路","10号线虹桥1号航站楼","10号线豫园","10号线邮电新村","10号线龙柏新村","10号线龙溪路","11号线三林","11号线三林东","11号线上海汽车城","11号线上海游泳馆","11号线上海西站","11号线上海赛车场","11号线云锦路","11号线兆丰路","11号线光明路","11号线南翔","11号线嘉定北","11号线嘉定新城","11号线嘉定西","11号线安亭","11号线御桥","11号线昌吉东路","11号线李子园路","11号线枫桥路","11号线桃浦新村","11号线武威路","11号线浦三路","11号线白银路","11号线真如","11号线祁连山路","11号线罗山路","11号线花桥","11号线隆德路","11号线马陆","11号线龙华","11号线龙耀路","12号线东陆路","12号线国际客运中心","12号线宁国路","12号线提篮桥","12号线杨高北路","12号线江浦公园","12号线爱国路","12号线申江路","12号线金京路","12号线金海路","12号线隆昌路","13号线丰庄","13号线大渡河路","13号线武宁路","13号线真北路","13号线祁连山南路","13号线金沙江西路","13号线金运路","16号线上海野生动物园","16号线临港大道","16号线书院","16号线华夏中路","16号线周浦东","16号线惠南","16号线惠南东","16号线新场","16号线滴水湖","16号线航头东","16号线鹤沙航城","1号线上海体育馆","1号线上海南站","1号线上海火车站","1号线上海马戏城","1号线中山北路","1号线人民广场","1号线共富新村","1号线共康路","1号线友谊西路","1号线呼兰路","1号线外环路","1号线宝安公路","1号线富锦路","1号线常熟路","1号线延长路","1号线彭浦新村","1号线徐家汇","1号线新闸路","1号线汉中路","1号线汶水路","1号线漕宝路","1号线莘庄","1号线莲花路","1号线衡山路","1号线通河新村","1号线锦江乐园","1号线陕西南路","1号线黄陂南路","2号线上海科技馆","2号线世纪公园","2号线东昌路","2号线中山公园","2号线凌空路","2号线创新中路","2号线北新泾","2号线华夏东路","2号线南京东路","2号线南京西路","2号线唐镇","2号线威宁路","2号线娄山关路","2号线川沙","2号线广兰路","2号线张江高科","2号线徐泾东","2号线江苏路","2号线浦东国际机场","2号线海天三路","2号线淞虹路","2号线虹桥2号航站楼","2号线虹桥火车站","2号线远东大道","2号线金科路","2号线陆家嘴","2号线静安寺","2号线龙阳路","3号线东宝兴路","3号线中潭路","3号线友谊路","3号线大柏树","3号线宜山路","3号线宝山路","3号线宝杨路","3号线延安西路","3号线张华浜","3号线曹杨路","3号线殷高西路","3号线水产路","3号线江杨北路","3号线江湾镇","3号线淞发路","3号线淞浜路","3号线漕溪路","3号线石龙路","3号线虹口足球场","3号线虹桥路","3号线赤峰路","3号线金沙江路","3号线铁力路","3号线镇坪路","3号线长江南路","3号线龙漕路","4号线上海体育场","4号线世纪大道","4号线东安路","4号线临平路","4号线南浦大桥","4号线塘桥","4号线大木桥路","4号线大连路","4号线杨树浦路","4号线浦东大道","4号线浦电路","4号线海伦路","4号线蓝村路","4号线鲁班路","5号线东川路","5号线剑川路","5号线北桥","5号线华宁路","5号线文井路","5号线春申路","5号线金平路","5号线银都路","5号线闵行开发区","5号线颛桥","6号线上南路","6号线上海儿童医学中心","6号线东方体育中心","6号线东明路","6号线东靖路","6号线临沂新村","6号线云山路","6号线五洲大道","6号线五莲路","6号线北洋泾路","6号线华夏西路","6号线博兴路","6号线外高桥保税区北","6号线外高桥保税区南","6号线巨峰路","6号线德平路","6号线民生路","6号线洲海路","6号线港城路","6号线源深体育中心","6号线灵岩南路","6号线航津路","6号线金桥路","6号线高科西路","6号线高青路","7号线上大路","7号线上海大学站","7号线云台路","7号线刘行","7号线南陈路","7号线后滩","7号线场中路","7号线大华三路","7号线大场镇","7号线岚皋路","7号线新村路","7号线昌平路","7号线杨高南路","7号线潘广路","7号线祁华路","7号线罗南新村","7号线美兰湖","7号线肇嘉浜路","7号线花木路","7号线芳华路","7号线行知路","7号线锦绣路","7号线长寿路","7号线长清路","7号线顾村公园","7号线龙华中路","8号线中兴路","8号线中华艺术宫","8号线凌兆新村","8号线四平路","8号线大世界","8号线嫩江路","8号线市光路","8号线延吉中路","8号线成山路","8号线曲阜路","8号线曲阳路","8号线杨思","8号线江月路","8号线江浦路","8号线沈杜公路","8号线浦江镇","8号线翔殷路","8号线耀华路","8号线老西门","8号线联航路","8号线芦恒路","8号线西藏北路","8号线西藏南路","8号线陆家浜路","8号线鞍山新村","8号线黄兴公园","8号线黄兴路","9号线七宝","9号线中春路","9号线九亭","9号线佘山","9号线合川路","9号线商城路","9号线嘉善路","9号线小南门","9号线打浦桥","9号线星中路","9号线杨高中路","9号线松江体育中心","9号线松江南站","9号线松江大学城","9号线松江新城","9号线桂林路","9号线泗泾","9号线洞泾","9号线漕河泾开发区","9号线醉白池","9号线马当路"]



con = MySQLdb.connect("localhost","root","likelin0610","zc",charset="utf8" )

cur = con.cursor()

sql = 'CREATE TABLE time_cost_23 (\
      time  int(5),\
      address_in varchar(20),\
      address_out varchar(20)) \
      '
cur.execute(sql)

for i in range(len(station)):
    for j in range(len(station)):
        try:
            sql_c='SELECT COUNT(*)\
            FROM `23_25_time`\
            WHERE address_in="'+station[i]+'"\
            AND address_out="'+station[j]+'"\
            '
            cur.execute(sql_c)

            data_c=cur.fetchall()
            for row in data_c:
                count=row[0]
                
            count=int(count*0.8)

            sql_t='SELECT date,TIME_TO_SEC(time),address_in,address_out \
                  FROM `23_25_time`  \
                  WHERE address_in="'+station[i]+'"\
                  AND address_out="'+station[j]+'" \
                  ORDER BY `time`\
                  LIMIT 0,'+str(count)+'\
                '
            cur.execute(sql_t)
            data_t=cur.fetchall()

            ttime=0

            for row in data_t:
                ttime=ttime+int(row[1])
                address_in=row[2]
                address_out=row[3]
            time=int(ttime/count)

            print time,address_in,address_out

            sql_i='INERT INTO time_cost_23\
                   VALUES('+str(time)+',"'+address_in+'","'+address_out+'")\
                   '
            cur.execute(sql_i)

            con.commit()
        except:
            pass

cur.close()
con.close()
